README.md
```mermaid
erDiagram
    DIM_CUSTOMER ||--o{ FACT_SALES : customer_key
    DIM_PRODUCT ||--o{ FACT_SALES : product_key
    DIM_DATE ||--o{ FACT_SALES : order_date_key
    DIM_CUSTOMER ||--o{ FACT_PAYMENT : customer_key
    DIM_DATE ||--o{ FACT_PAYMENT : payment_date_key
    DIM_CUSTOMER ||--o{ FACT_PLAYLIST_ACTIVITY : customer_key
    DIM_PRODUCT ||--o{ FACT_PLAYLIST_ACTIVITY : product_key
    DIM_DATE ||--o{ FACT_PLAYLIST_ACTIVITY : added_date_key

    DIM_CUSTOMER {
      bigint customer_key PK
      bigint customer_id NK
      text email
      text country
      text status
      timestamptz effective_from
      timestamptz effective_to
      boolean is_current
      char record_hash
    }
    DIM_PRODUCT {
      bigint product_key PK
      text product_nk NK
      text product_type
      bigint track_id
      bigint album_id
      text primary_artist
      text primary_genre
      numeric unit_price
    }
    FACT_SALES {
      bigint order_item_id PK
      bigint order_id
      bigint customer_key FK
      bigint product_key FK
      int order_date_key FK
      numeric gross_amount
      numeric allocated_discount
      numeric allocated_tax
      numeric net_amount
    }
    FACT_PAYMENT {
      bigint payment_id PK
      bigint customer_key FK
      int payment_date_key FK
      numeric amount
      text payment_status
      text payment_mode
    }
```
